cs1-handouts/2016-05-19-final-graphs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-19 Thu 11:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Daniel Bergey" />
</head>
<body>
<div id="content">
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Start with a Question</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
For our final project of the year, you can pick (almost) any data you are interested in to graph.  Your graph should answer some interesting question.  For this assignment, an <b>interesting</b> question is one that could help someone to make a decision, preferably a politically, economically, or culturally important decision.
</p>

<ul class="org-ul">
<li>You can start with a question and look for data to help answer it, or look at available data, and frame a question that can be answered from these data.  Either order is fine.  For example:</li>
<li>If the city of Philadelphia wants to save energy, they might be interested in seeing which buildings use the most energy, or the <a href="http://bergey.github.io/sluice-graph/">most energy per square foot</a>.u</li>
<li>If you want to know how <a href="http://thenotebook.org/uploads/files/733868014641451895-pa-school-funding-racial-bias.pdf">students' race affects school funding</a>, you need to look at four variables - school funding, number of students, race, and income in the district.</li>
<li>If you want to know how fast computers will be in 2030, you might look at how fast they've been each year for the last 20 or 30.</li>
<li>On the other hand, "How many people in each state have a first name starting with the letter Q?" probably isn't an interesting question.  If you want to ask a question like that, you'll need to work much harder to convince me it's interesting.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Data Sources</h2>
<div class="outline-text-2" id="text-orgheadline2">
<ul class="org-ul">
<li><a href="https://www.opendataphilly.org/">https://www.opendataphilly.org/</a></li>
<li><a href="https://www.data.gov/">https://www.data.gov/</a></li>
<li>Ask me if you have a different source of data in mind.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3">Graph Types</h2>
<div class="outline-text-2" id="text-orgheadline3">
<p>
Pick a graph that's appropriate to your question and your data.  Refer back to the graph examples in the <a href="http://cs1.friendscentral.org/handouts/2016-05-02-graphs.html">previous handout</a>.  I expect most of you will make a line chart, bar chart, or scatter plot, but you might find one of the other graphs most appropriate.  (We don't have time for maps this year.)
</p>

<p>
Consider:
</p>
<ul class="org-ul">
<li>How many variables do you need to show?</li>
<li>Which variables are numbers?</li>
<li>Which variables are discrete / categorical?  How many categories are there?</li>
<li>If you only have a few categories, color works well to tell them apart.  You can have differently colored circles or lines.</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4">Graph Requirements</h2>
<div class="outline-text-2" id="text-orgheadline4">
<p>
Every graph should have the following:
</p>
<ul class="org-ul">
<li>data markers (bars, circles, lines,whatever)</li>
<li>axis tick marks with labels (eg, numbers, or the name of each bar)</li>
<li>axis labels, including units, if any. Examples:
<ul class="org-ul">
<li>"Energy Produced [kWh/yr]"</li>
<li>"Average Age [years]")</li>
</ul></li>
<li>a title (this can be in the surrounding HTML)</li>
</ul>

<p>
If you have time, there are many ways to enhance a Javascript graph.  Here are some ideas:
</p>
<ul class="org-ul">
<li>Pick tick mark locations that make it easier to compare multiple similar graphs.</li>
<li>Add a second line or set of dots in a second color</li>
<li>If you have multiple colors, add a legend</li>
<li>Mouseover - show more details about the selected circle / bar in an HTML table or list.</li>
<li>Pulldown menu - let the viewer select from multiple years or categories of data</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5">Deliverables</h2>
<div class="outline-text-2" id="text-orgheadline5">
<p>
In addition to your graph, your HTML page should have text answering the following questions:
</p>

<ul class="org-ul">
<li>What question were you trying to answer?</li>
<li>Why is this question important / interesting?  To whom?  What will they do differently, depending on the answer?</li>
<li>URL from which you got the data. (Make it a link.)</li>
<li>Describe any changes you made to the files that you downloading.  For example, renaming the columns, deleting rows, deleting columns, deleting commas in numbers, converting to .csv / .tsv.</li>
<li>Does the graph answer the original question?  If so, what is the answer?  If not, what graph would you try next, or what additional data would you need?</li>
<li>What new question or questions does your graph raise?</li>
</ul>
</div>
</div>
</div>
</body>
</html>
